In [28]:
# Data input and output

In [29]:
# CSV
# Excel
# HTML
# SQL

In [30]:
import pandas as pd

In [31]:
pd.read_csv('example.csv')

    a   b   c
0   1   2   3
1   4   5   6
2   7   8   9
3  10  11  12
4  13  14  15

In [32]:
df = pd.read_csv('example.csv')

In [33]:
df.to_csv('my_output', index=False)

In [34]:
pd.read_csv('my_output')

    a   b   c
0   1   2   3
1   4   5   6
2   7   8   9
3  10  11  12
4  13  14  15

In [35]:
pd.read_excel('excel_sample.xlsx', sheet_name='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [36]:
df.to_excel('excel_sample2.xlsx', sheet_name='NewSheet')

In [37]:
data = pd.read_html('file:///C:/Users/wolz.CODElife/Desktop/LearningPython/DataScience/index.html')

In [38]:
data[0].head()

   ID Firstname Lastname
0   1      Joel  Adewole
1   2    Samuel  Adewole

In [39]:
from sqlalchemy import create_engine

In [40]:
engine = create_engine('sqlite:///:memory:')

In [41]:
df.to_sql('my_table', engine)

In [42]:
sqldf = pd.read_sql('my_table', con=engine)

In [43]:
sqldf

   index   a   b   c
0      0   1   2   3
1      1   4   5   6
2      2   7   8   9
3      3  10  11  12
4      4  13  14  15